RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.0.0_a53641a/components/nfc/t2t_lib/hal_t2t/hal_nfc_t2t.c
    NRF_NFCT->INTENSET = (NFCT_INTENSET_ERROR_Enabled    << NFCT_INTENSET_ERROR_Pos) |
                         (NFCT_INTENSET_SELECTED_Enabled << NFCT_INTENSET_SELECTED_Pos);

    // Use Window Grid frame delay mode.
    NRF_NFCT->FRAMEDELAYMODE = (NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid <<
                               NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos) &
                               NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Msk;

    hal_nfc_nfcid1_registers_setup();
}

/** @brief Setup NRF_NFCT->NFCID1 and NRF_NFCT->SENSRES registers based on m_nfcid1_data and m_nfcid1_length variables.
 */
static void hal_nfc_nfcid1_registers_setup(void)
{
    uint32_t sens_res_size;         // Value that will be written to NRF_NFCT->SENSRES
    uint8_t* p_nfcid_remaining_data;  // Points to the first byte of m_nfcid1_data remaining to write to NRF_NFCT->NFCID1 registers

    p_nfcid_remaining_data = m_nfcid1_data;

    if (m_nfcid1_length == NFCID1_SINGLE_SIZE)
    {
        sens_res_size = NFCT_SENSRES_NFCIDSIZE_NFCID1Single;
    }
    else
    {
        if (m_nfcid1_length == NFCID1_DOUBLE_SIZE)
        {
            sens_res_size = NFCT_SENSRES_NFCIDSIZE_NFCID1Double;
        }
        else // then m_nfcid1_length == NFCID1_TRIPLE_SIZE
        {
            /* MSB of NFCID1_3RD_LAST register is not used - always 0 */
            NRF_NFCT->NFCID1_3RD_LAST =
                ((uint32_t) p_nfcid_remaining_data[0] << NFCID1_3RD_LAST_BYTE2_SHIFT) |
                ((uint32_t) p_nfcid_remaining_data[1] << NFCID1_3RD_LAST_BYTE1_SHIFT) |
                ((uint32_t) p_nfcid_remaining_data[2] << NFCID1_3RD_LAST_BYTE0_SHIFT);
            p_nfcid_remaining_data += 3;
            sens_res_size           = NFCT_SENSRES_NFCIDSIZE_NFCID1Triple;
        }
        /* MSB of NFCID1_2ND_LAST register is not used - always 0 */
        NRF_NFCT->NFCID1_2ND_LAST =
            ((uint32_t) p_nfcid_remaining_data[0] << NFCID1_2ND_LAST_BYTE2_SHIFT) |
            ((uint32_t) p_nfcid_remaining_data[1] << NFCID1_2ND_LAST_BYTE1_SHIFT) |
            ((uint32_t) p_nfcid_remaining_data[2] << NFCID1_2ND_LAST_BYTE0_SHIFT);
        p_nfcid_remaining_data += 3;
    }

    NRF_NFCT->NFCID1_LAST =
        ((uint32_t) p_nfcid_remaining_data[0] << NFCID1_LAST_BYTE3_SHIFT) |
        ((uint32_t) p_nfcid_remaining_data[1] << NFCID1_LAST_BYTE2_SHIFT) |
        ((uint32_t) p_nfcid_remaining_data[2] << NFCID1_LAST_BYTE1_SHIFT) |
        ((uint32_t) p_nfcid_remaining_data[3] << NFCID1_LAST_BYTE0_SHIFT);

    /* Begin: Bugfix for FTPAN-25 (IC-9929) */
    /* Workaround for wrong SENSRES values require using SDD00001, but here SDD00100 is used
       because it's required to operate with Windows Phone */
    NRF_NFCT->SENSRES =
            (sens_res_size << NFCT_SENSRES_NFCIDSIZE_Pos) |
            (NFCT_SENSRES_BITFRAMESDD_SDD00100   << NFCT_SENSRES_BITFRAMESDD_Pos);
    /* End:   Bugfix for FTPAN-25 (IC-9929)*/
}

/** @brief Call nfc_t2t_internal_set() with data generated based on m_nfcid1_data and m_nfcid1_length variables.
 */
static void hal_nfc_internal_bytes_setup(void)
{
    if (m_nfcid1_length == NFCID1_TRIPLE_SIZE)
    {
        (void) nfc_t2t_internal_set(m_nfcid1_data, T2T_INTERNAL_BYTES_NR);
    }
    else
    {
        uint8_t  nfc_internal[T2T_INTERNAL_BYTES_NR];

        if (m_nfcid1_length == NFCID1_DOUBLE_SIZE)
        {
                                                                  // CASCADE TAG send over the air, but not included in internal data
            nfc_internal[0] = m_nfcid1_data[0];                   // UID0 = Manufacturer ID
            nfc_internal[1] = m_nfcid1_data[1];                   // UID1
            nfc_internal[2] = m_nfcid1_data[2];                   // UID2
            nfc_internal[3] = (uint8_t) CASCADE_TAG_BYTE ^ nfc_internal[0] ^
                              nfc_internal[1] ^ nfc_internal[2];  // BCC0 = XOR over the 4 previous bytes
            nfc_internal[4] = m_nfcid1_data[3];                   // UID3
            nfc_internal[5] = m_nfcid1_data[4];                   // UID4
            nfc_internal[6] = m_nfcid1_data[5];                   // UID5
            nfc_internal[7] = m_nfcid1_data[6];                   // UID6
            nfc_internal[8] = nfc_internal[4] ^ nfc_internal[5] ^
                              nfc_internal[6] ^ nfc_internal[7];  // BCC1 = XOR over the 4 previous bytes
            nfc_internal[9] = NFC_LIB_VERSION;                    // For internal use
        }
        else // then m_nfcid1_length == NFCID1_SINGLE_SIZE
        {
            nfc_internal[0] = m_nfcid1_data[0];                   // UID0 = Manufacturer ID
            nfc_internal[1] = m_nfcid1_data[1];                   // UID1
            nfc_internal[2] = m_nfcid1_data[2];                   // UID2
            nfc_internal[3] = m_nfcid1_data[3];                   // UID3
            nfc_internal[4] = nfc_internal[0] ^ nfc_internal[1] ^
                              nfc_internal[2] ^ nfc_internal[3];  // BCC0 = XOR over the 4 previous bytes
            memset(&nfc_internal[5], 0xFF, 4);                    // 4-byte padding
            nfc_internal[9] = NFC_LIB_VERSION;                    // For internal use
        }

        (void) nfc_t2t_internal_set(nfc_internal, T2T_INTERNAL_BYTES_NR);
    }
}

ret_code_t hal_nfc_setup(hal_nfc_callback_t callback, void * p_context)
{
    m_nfc_lib_callback = callback;
    m_nfc_lib_context  = p_context;

    if (m_nfcid1_length == 0)
    {
        m_nfcid1_length = NFCID1_DEFAULT_LENGHT;
        hal_nfc_nfcid1_default_bytes();
    }

    hal_nfc_common_hw_setup();
    hal_nfc_internal_bytes_setup();

    /* Initialize SDK Clock module for handling high precission clock requests */
    m_clock_handler_item.event_handler = nrf_nfct_clock_event_handler;
    m_clock_handler_item.p_next        = NULL;

    ret_code_t err_code = nrf_drv_clock_init();

#if defined(HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND) || defined(HAL_NFC_NRF52840_ENGINEERING_ABC_WORKAROUND)
    #if defined(HAL_NFC_NRF52840_ENGINEERING_ABC_WORKAROUND)
    if (!type_52840_sample_check())
    #endif // defined(HAL_NFC_NRF52840_ENGINEERING_ABC_WORKAROUND)
    {
        field_timer_with_callback_config();
    }
#endif // defined(HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND) || defined(HAL_NFC_NRF52840_ENGINEERING_ABC_WORKAROUND)

    NRF_LOG_INFO("Init");
    HAL_NFC_DEBUG_PINS_INITIALIZE();

